In [1]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

import getpass

In [2]:
password = getpass.getpass()

········

In [3]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/bank'
engine = create_engine(connection_string)

### 1.

In [17]:
distinct_last_names = pd.read_sql_query('SELECT COUNT(DISTINCT (last_name)) AS distinct_last_names \
FROM sakila.actor', engine)
distinct_last_names.head()

   distinct_last_names
0                  121

### 2.

In [36]:
query_ww = '''SELECT *, 
CASE WHEN(DATE_FORMAT(CONVERT(rental_date, DATE), '%%W') IN ('Saturday', 'Sunday')) THEN "Weekend"  
ELSE "Workday" END AS day_type \
FROM sakila.rental;'''

workday_weekday = pd.read_sql_query(query_ww, engine)

workday_weekday.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,day_type
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,Workday
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,Workday
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,Workday
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,Workday
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,Workday

### 3.

In [39]:
query_arm = '''SELECT title \
FROM sakila.film \
WHERE title LIKE '%%Armageddon%%' '''

armaggeddon = pd.read_sql_query(query_arm, engine)

armaggeddon.head()

                   title
0        ARMAGEDDON LOST
1    LADYBUGS ARMAGEDDON
2       METAL ARMAGEDDON
3    MOSQUITO ARMAGEDDON
4  STAGECOACH ARMAGEDDON

### 4.

In [41]:
query_long = '''SELECT title, length
FROM sakila.film
ORDER BY length DESC
LIMIT 10'''

longest = pd.read_sql_query(query_long, engine)

longest.head(10)

                title  length
0      DARN FORRESTER     185
1        POND SEATTLE     185
2       CHICAGO NORTH     185
3       MUSCLE BRIGHT     185
4        WORST BANGER     185
5         GANGS PRIDE     185
6  SOLDIERS EVOLUTION     185
7           HOME PITY     185
8   SWEET BROTHERHOOD     185
9      CONTROL ANTHEM     185

### 5.

In [44]:
query_bts = '''SELECT COUNT(*) AS 'Behind the Scenes'
FROM sakila.film
WHERE special_features LIKE '%%Behind the Scenes%%' '''

bts = pd.read_sql_query(query_bts, engine)

bts.head()

   Behind the Scenes
0                538

### 6.

In [46]:
query_a2h = '''SELECT rating, ROUND(AVG(length), 2) AS average_lenght_per_rating
FROM sakila.film
GROUP BY rating
HAVING average_lenght_per_rating > 120'''

above_2h = pd.read_sql_query(query_a2h, engine) 

above_2h.head()

  rating  average_lenght_per_rating
0  PG-13                     120.44

### 7.

In [49]:
query_rank = '''SELECT title, length, RANK() OVER(ORDER BY length DESC) AS 'Rank'
FROM sakila.film
WHERE length IS NOT NULL AND length !=0'''

rank = pd.read_sql_query(query_rank, engine)

rank.head(15)

                 title  length  Rank
0        CHICAGO NORTH     185     1
1       CONTROL ANTHEM     185     1
2       DARN FORRESTER     185     1
3          GANGS PRIDE     185     1
4            HOME PITY     185     1
5        MUSCLE BRIGHT     185     1
6         POND SEATTLE     185     1
7   SOLDIERS EVOLUTION     185     1
8    SWEET BROTHERHOOD     185     1
9         WORST BANGER     185     1
10   CONSPIRACY SPIRIT     184    11
11    CRYSTAL BREAKING     184    11
12      KING EVOLUTION     184    11
13     MOONWALKER FOOL     184    11
14     SMOOCHY CONTROL     184    11